Backend/app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("name") VALUES ($1) RETURNING "id"  [["name", "Tashawn"]]
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "Tashawn"], ["LIMIT", 1]]
INSERT INTO "scores" ("score", "user_id") VALUES ($1, $2) RETURNING "id"  [["score", 15], ["user_id", 3]]
---
 def create
   @user = User.find_or_create_by(name: params[:name])
   @score = Score.create(score: params[:score])